import fs from 'fs';

const filePath = './personalize.json';

let handler = async (m, { conn }) => {
    try {
        const data = JSON.parse(fs.readFileSync(filePath));

        // Cargar datos globales y predeterminados
        const globalConfig = data.global;
        const defaultConfig = data.default;

        const botName = globalConfig.botName || defaultConfig.botName;
        const currency = globalConfig.currency || defaultConfig.currency;
        const videos = globalConfig.videos.length > 0 ? globalConfig.videos : defaultConfig.videos;

        const randomVideoUrl = videos[Math.floor(Math.random() * videos.length)];

        const menuMessage = `
╭┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉
┊🤖 : 𝐌𝐀𝐅𝐈𝐀-𝐁𝐎𝐓
┊👑 : 𝐎𝐖𝐍𝐄𝐑: ${dev}
┊🔰 :𝐕𝐄𝐑𝐒𝐈𝐎́𝐍: ${vs}
╰┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉

𖤐     𝐇𝐎𝐋𝐀 𝐒𝐎𝐘 𝐌𝐀𝐅𝐈𝐀-𝐁𝐎𝐓 🥷🏻
  *¡¡𝐄𝐬𝐭𝐚 𝐞𝐬 𝐦𝐢 𝐥𝐢𝐬𝐭𝐚 𝐝𝐞 𝐜𝐨𝐦𝐚𝐧𝐝𝐨𝐬!!*
💰 𝐌𝐨𝐧𝐞𝐝𝐚 𝐚𝐜𝐭𝐮𝐚𝐥: ${currency}

→         👑 𝐒𝕆𝐋𝕆 𝕆𝐖𝐍𝔼𝐑 👑

╭┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#setname*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#setbanner*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#setmoneda*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#viewbanner*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#deletebanner*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#resetpreferences*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#update*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#dsowner*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#join*
╰┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┅

→     ⚙️ 𝐀𝔻𝐌𝕀𝐍𝐈𝕊𝐓ℝ𝐀ℂ𝐈𝐎ℕ ⚙️

╭┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#kick*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#getplugin*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#getpack*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#store*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#status*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#ping*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#gemini*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#pinterest*
╰┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉

→              🎲 𝐑𝔸𝐍𝐃𝕆𝐌 🎲

╭┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#rm*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#winfo*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#rollwaifu*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#claim*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#harem*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#addrw*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#alya • #bot*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#kaori*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#waifu*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#fakengl*
╰┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉

→            🎧 𝐃𝔼𝐒𝐂𝔸𝐑𝔾𝐀𝕊 🎧

╭┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#playaudio* [ audio ]
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#ytmp4* [ video ]
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#tt* [ enlace ] 
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#sp* [ enlace ]
╰┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉

→             🏦 𝐄ℂ𝐎𝐍𝕆𝐌𝐈́𝔸 🏦

╭┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#work*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#slut*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#robar*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#deposit* [ cantidad ]
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#retirar* [ cantidad ]
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#transferir* [ cantidad ] @usuario
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#perfil*
╰┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉

→    ⛩️  𝐑𝔼𝐀ℂ𝐈𝐎ℕ𝐄𝕊 𝐀ℕ𝐈𝕄𝐄  ⛩️

╭┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#abarazar*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#aburrido*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#bañarse*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#bleh*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#comer*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#dance*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#enojada*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#feliz*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#kiss*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#love*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#matar*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#morder*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#nalguear*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#punch*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#saludar*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#bofetada*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#dormir*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#smoke*
┊⫍ּ̯̤۬̊🥷🏻̸̷ּ̫۪۪۪፝֟ᰅּ໋݄۠ׄ꒢ּ̤֩۬๑ּ̯֠᪲۬→ *#paja*
╰┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉┉
> ${copy} powered by ${dev}
`;

        await conn.sendMessage(
            m.chat,
            {
                video: { url: randomVideoUrl },
                gifPlayback: true,
                caption: menuMessage,
                mentions: [m.sender]
            }
        );
    } catch (error) {
        conn.reply(m.chat, `❌ Error al cargar el menú: ${error.message}`, m);
    }
};

handler.help = ['menu'];
handler.tags = ['info'];
handler.command = ['menu', 'help'];

export default handler;

/* estilos de menu

┎───•✧•───⌬
┃
┖───•✧•  */
